{
  "1.1.1": {
    "id": "1.1.1",
    "title": "1.1.1 Contenido sin texto (Nivel A)",
    "descripcion": "El contenido no textual que se presenta al usuario tiene una alternativa textual que cumple el propósito equivalente.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/non-text-content"
  },
  "1.2.1": {
    "id": "1.2.1",
    "title": "1.2.1 Solo audio y video pregrabado (Nivel A)",
    "descripcion": "Para el audio y video pregrabado se proporciona una alternativa para los medios basados en el tiempo que presenta información equivalente sobre el contenido. Además, para el video se puede proporcionar una pista de audio.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/audio-only-and-video-only-prerecorded"
  },
  "1.2.2": {
    "id": "1.2.2",
    "title": "1.2.2 Subtítulos (Pregrabado) (Nivel A)",
    "descripcion": "Se proporcionan subtitulos para todos los contenidos de audio pregrabados en medios sincronizados, excepto cuando los medios son una alternativa al texto.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/captions-prerecorded"
  },
  "1.2.3": {
    "id": "1.2.3",
    "title": "1.2.3 Descripción de audio o alternativa de medios (Pregrabado) (Nivel A)",
    "descripcion": "Se proporciona una alternativa para los medios basados en el tiempo o la descripción de audio del contenido de vídeo pregrabado, excepto cuando los medios son una alternativa para el texto.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/audio-description-or-media-alternative-prerecorded"
  },
  "1.2.5": {
    "id": "1.2.5",
    "title": "1.2.5 Descripción de audio (Pregrabado) (Nivel AA)",
    "descripcion": "La descripcion del audio se debe ofrecer para todos el contenido de videos pregrabados.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/audio-description-prerecorded"
  },
  "1.3.1": {
    "id": "1.3.1",
    "title": "1.3.1 Información y Relaciones (Nivel A)",
    "descripcion": " La información, la estructura y las relaciones que se transmiten a través de la presentación deben determinarse de forma programada o estar disponibles en el texto.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/info-and-relationships"
  },
  "1.3.2": {
    "id": "1.3.2",
    "title": "1.3.2 Secuencia significativa (Nivel A)",
    "descripcion": "Si la secuencia en la que se presenta el contenido afecta al significado de este, se puede determinar de manera programada una secuencia de lectura correcta.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/meaningful-sequence"
  },
  "1.4.2": {
    "id": "1.4.2",
    "title": "1.4.2 Control de sonido (Nivel A)",
    "descripcion": "Si el audio de una página web se reproduce automáticamente durante más de 3 segundos, existe un mecanismo para pausar o detener el audio, o un mecanismo para controlar el volumen del audio independientemente del nivel de volumen general del sistema.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/audio-control"
  },
  "1.4.3": {
    "id": "1.4.3",
    "title": "1.4.3 Contraste (Minimo) (Nivel AA)",
    "descripcion": "La presentación visual del texto y de las imágenes del texto tiene una relación de contraste de al menos 4,5:1, excepto textos grandes y logotipos.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/contrast-minimum"
  },
  "2.1.1": {
    "id": "2.1.1",
    "title": "2.1.1 Teclado (Nivel A)",
    "descripcion": "La funcionalidad del contenido es operable a través de una interfaz de teclado sin requerir tiempos específicos para las pulsaciones individuales, excepto cuando se requiere una entrada que depende de la trayectoria del movimiento del usuario y no sólo de los puntos finales.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/keyboard"
  },
  "2.1.2": {
    "id": "2.1.2",
    "title": "2.1.2 Sin trampa de teclado (Nivel A)",
    "descripcion": "Si el foco del teclado se puede mover a un componente de la página utilizando una interfaz de teclado, entonces el foco se puede alejar de ese componente utilizando sólo una interfaz de teclado. Si requiere más que las teclas de flecha o de tabulación no modificadas u otros métodos de salida estándar, se avisa al usuario del método para alejar el foco.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/no-keyboard-trap"
  },
  "2.2.1": {
    "id": "2.2.1",
    "title": "2.2.1 Tiempo ajustable (Nivel A)",
    "descripcion": "El usuario puede interactuar con el contenido dependiendo del límite que tenga establecido (apagar, ajustar, extender, excepción en tiempo real, excepción esencial, excepción de 20 horas.)",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/timing-adjustable"
  },
  "2.2.2": {
    "id": "2.2.2",
    "title": "2.2.2 Pausa, Detener, Ocultar (Nivel A)",
    "descripcion": "Para cualquier información que se mueva, parpadee o se desplace automáticamente, dure más de cinco segundos y se presente en paralelo con otro contenido, existe un mecanismo para que el usuario pause, detenga u oculte a menos que el movimiento, parpadeo o desplazamiento sea parte de una actividad en la que sea esencial. Lo mismo ocurren con la actualización automática de la información.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/pause-stop-hide"
  },
  "2.4.1": {
    "id": "2.4.1",
    "title": "2.4.1 Bloques de derivación (Nivel A)",
    "descripcion": "Se trata de un mecanismo para omitir bloques de contneido que se repiten en varias páginas web.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/bypass-blocks"
  },
  "2.4.2": {
    "id": "2.4.2",
    "title": "2.4.2 Página titulada (Nivel A)",
    "descripcion": "Los títulos de las páginas deben describir el tema o el propósito.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/page-titled"
  },
  "2.4.3": {
    "id": "2.4.3",
    "title": "2.4.3 Orden de enfoque (Nivel A)",
    "descripcion": "Si la página web puede ser navegada secuencialmente y las secuencias de navegación afectan al significado o al funcionamiento, los componentes reciben el foco en un orden que preserva el significado y la operatividad.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/focus-order"
  },
  "2.4.4": {
    "id": "2.4.4",
    "title": "2.4.4 Propósito del enlace (En contexto) (Nivel A)",
    "descripcion": "La finalidad de cada enlace puede determinarse a partir del texto del enlace por sí solo o del texto del enlace junto con su contexto de enlace determinado mediante programación, excepto cuando la finalidad del enlace sea ambigua para los usuarios.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/link-purpose-in-context"
  },
  "2.4.6": {
    "id": "2.4.6",
    "title": "2.4.6 Encabezados y etiquetas (Nivel AA)",
    "descripcion": "Estos deben describir el tema o el propósito.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/headings-and-labels"
  },
  "2.5.3": {
    "id": "2.5.3",
    "title": "2.5.3 Etiqueta en el nombre (Nivel A)",
    "descripcion": "Para los componentes de la interfaz de usuario con etiquetas que incluyen texto o imágenes de texto, el nombre contiene el texto que se presenta visualmente.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/label-in-name"
  },
  "3.1.1": {
    "id": "3.1.1",
    "title": "3.1.1 Idioma de la página (Nivel A)",
    "descripcion": "El idioma por defecto de cada página web puede determinarse mediante programación.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/language-of-page"
  },
  "3.1.2": {
    "id": "3.1.2",
    "title": "3.1.2 Idioma de las partes (Nivel AA)",
    "descripcion": "El lenguaje de cada frase del contenido puede determinarse de forma programada, excepto los nombres propios, los términos técnicos, las palabras de lenguaje indeterminado y las palabras o frases que han pasado a formar parte de la lengua nativa del texto.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/language-of-parts"
  },
  "3.2.2": {
    "id": "3.2.2",
    "title": "3.2.2 En la entrada (Nivel A)",
    "descripcion": "El cambio de la configuración de cualquier componente de la interfaz de usuario no provoca un cambio de contexto automáticamente, a menos que el usuario haya sido advertido del comportamiento antes de utilizarlo.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/on-input"
  },
  "3.3.1": {
    "id": "3.3.1",
    "title": "3.3.1 Error de identificación (Nivel A)",
    "descripcion": "Si se detecta automáticamente un error de entrada, se identifica el elemento que está en error y se describe el error al usuario en texto.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/error-identification"
  },
  "3.3.2": {
    "id": "3.3.2",
    "title": "3.3.2 Etiquetas o instrucciones (Nivel A)",
    "descripcion": "Estas se proporcionan cuando el contenido requiere la intervención del usuario.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/labels-or-instructions"
  },
  "4.1.2": {
    "id": "4.1.2",
    "title": "4.1.2 Nombre, Rol, Valor (Nivel A)",
    "descripcion": "Para todos los componentes de la interfaz de usuario, el nombre y la función pueden determinarse mediante programación; los estados, las propiedades y los valores que puede establecer el usuario pueden establecerse mediante programación; y la notificación de los cambios en estos elementos está disponible para los agentes de usuario. ",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/name-role-value"
  },
  "4.1.3": {
    "id": "4.1.3",
    "title": "4.1.3 Mensajes de estado (Nivel AA)",
    "descripcion": "En los contenidos implementados mediante lenguajes de marcado, los mensajes de estado pueden determinarse mediante programación a través de funciones o propiedades, de manera que puedan ser presentados al usuario por las tecnologías de asistencia sin recibir el foco.",
    "link": "https://www.w3.org/WAI/WCAG21/Understanding/status-messages"
  }
}
